Lsteyn166/EPR400/STM32/RTE/Device/STM32F756VGTx/STCubeGenerated/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM7_Init(void);
static void MX_I2C1_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void Debug(char *Array, int count);														//Sends something to UART1 for debugging
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart);				//Sends error message with Debug()
void SetupTimers(void);																				//Configure timers 6 and 7 for use in servo control
void Sort(void);																							//Sorts timer values into ascending order
void SetServo(int servo, int degrees);												//Sets the timer value for a servo from a degree value
struct servos IK( struct coordinates input);									//Inverse Kinematics function
bool CheckBounds(struct servos leg);													//Check if legs need to be reset
struct coordinates Rotate(double x, double y, double angle);	//Rotate coordinates about an angle
void TranslateLeg(void);																			//Generates constants at beginning of program
struct coordinates Vector(double x, double y, int leg, bool offset, double r);
void StartPosition(void);																			//Resets robot to default position
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart);			//ISR for when bluetooth communication is received.
void BTDecrypt(void);																//Resturns vectors sent from android
void ServoUpdate(void);																				//Moves entire buffer over at once to servos
void Delay(int a);																						//Delays program for a cycles of 20ms
void ResetLeg(int leg);																				//Moves the specified leg back to its origin
void DestinationUpdate(int leg);															//Calculates the new destination from the input vectors and the current values

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART3_UART_Init();
  MX_USART1_UART_Init();
  MX_TIM6_Init();
  MX_TIM7_Init();
  MX_I2C1_Init();

  /* USER CODE BEGIN 2 */
	SetupTimers();
	StartPosition();

	TranslateLeg();

	Debug("Init done",9);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	Debug("Entering main loop",18);
	HAL_UART_Receive_IT(&huart3,RXDataBuffer,15);											//Receive commands via bluetooth in interrupt mode
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		//Turn off all LEDs except red
		HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(greenLEDPort,greenLEDPin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(redLEDPort,redLEDPin,GPIO_PIN_RESET);
		
		Debug("Waiting for Bluetooth...",24);
		
		while (BTon == false)
		{
			//Wait here for connection
		}
		//Turn off all LEDs except blue
		HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(greenLEDPort,greenLEDPin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(redLEDPort,redLEDPin,GPIO_PIN_SET);
		Debug("Turning on servos...",20);
		//Move servos to home position
		StartPosition();
		//Turn on power to servos
		HAL_GPIO_WritePin(servoPowerPort,servoPowerPin,GPIO_PIN_SET);
		//Delay for 1 second to get things started
		Delay(10);
		//Put legs in the 0,0,50 position one at a time
		for (int leg = 1; leg <6; leg++)
		{
			struct coordinates leg_Vector = Vector(0,0,leg,true,0);
			leg_Vector.z = 50;			//Lift legs above ground
			struct servos leg_servo = IK(leg_Vector);
			
			SetServo(leg,leg_servo.theta);
			SetServo(leg+5,leg_servo.phi);
			SetServo(leg+10,leg_servo.alpha);
			ServoUpdate();
			Delay(10);
		}
		//Slowly raise the body
		for (int height = 50 ; height >0 ; --height)
		{
			for (int leg = 1; leg <6; leg++)
			{
				struct coordinates leg_Vector = Vector(0,0,leg,true,0);
				leg_Vector.z = height;			//Lift legs above ground
				struct servos leg_servo = IK(leg_Vector);
				
				SetServo(leg,leg_servo.theta);
				SetServo(leg+5,leg_servo.phi);
				SetServo(leg+10,leg_servo.alpha);
				ServoUpdate();
			}
			Delay(2);
		}
		//Turn off all LEDs except green
		HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(greenLEDPort,greenLEDPin,GPIO_PIN_RESET);
		HAL_GPIO_WritePin(redLEDPort,redLEDPin,GPIO_PIN_SET);
		Debug("Ready...",8);
		
		//This is the main part that executes while the bluetooth is connected
		while(BTon)
		{
			//Get the vectors from the last transmitted message
			BTDecrypt();
			//Perform inverse kinematics
			for (int leg = 1; leg <6; leg++)
			{
//				struct coordinates leg_Vector = Vector(-X_Vect,-Y_Vect,leg,true);  //!!!!!!!!!This does not accumulate!!!!!!!!!!!!!!!!!!!!!!			
				DestinationUpdate(leg);
				struct coordinates leg_Vector;
				leg_Vector.x = currentPosition[0][leg-1];
				leg_Vector.y = currentPosition[1][leg-1];
				leg_Vector.z = 0;
				struct servos leg_servo = IK(leg_Vector);
				//Check if this is out ouf bounds
				if (CheckBounds(leg_servo))
				{
					resetStatus[leg-1] = true;
				}else{
					resetStatus[leg-1] = false;
				}
				SetServo(leg,leg_servo.theta);
				SetServo(leg+5,leg_servo.phi);
				SetServo(leg+10,leg_servo.alpha);
			}
			//Reset legs if necessary
			for (int leg = 1; leg < 6; leg++)
			{
				if (resetStatus[leg-1] == true)
				{
					//Turn on all LEDs (white)
					HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_RESET);
					HAL_GPIO_WritePin(greenLEDPort,greenLEDPin,GPIO_PIN_RESET);
					HAL_GPIO_WritePin(redLEDPort,redLEDPin,GPIO_PIN_RESET);
					//Reset leg
					ResetLeg(leg);
				}
			}
			//Move the legs to where we want them
			ServoUpdate();
			//Turn off all LEDs except green
			HAL_GPIO_WritePin(BTPort,BTLEDPin,GPIO_PIN_SET);
			HAL_GPIO_WritePin(greenLEDPort,greenLEDPin,GPIO_PIN_RESET);
			HAL_GPIO_WritePin(redLEDPort,redLEDPin,GPIO_PIN_SET);
		}
		
		

